#include <iostream>
using namespace std;

int main()
{
    //空指针和野指针:
    //空指针:指针变量指向内存中编号为0的空间,作用是初始化指针变量,空指针所指向的内存不可访问

    int* m = NULL;
    //野指针:指针变量指向非法的内存空间
    int* n = (int*)0x1000;//指针变量指向编号为0x1000的空间

    //空指针和野指针都不是我们申请的空间,尽量不要访问

    /*
    const修饰指针:

    const修饰指针->常量指针        指针的指向可以修改，但指针指向的值不可以修改
    const修饰常量->指针常量        指针的指向不可以修改，但指针指向的值可以修改
    const既修饰指针,又修饰常量     指针的指向以及指向的值都不可修改
    */

    int a = 10;
    int b = 9;
    const int* p1 = &a;//常量指针,指针的指向可以修改，但指针指向的值不可以修改
    p1 = &b;
    cout <<"* p1 = " << *p1 << endl;
    
    int* const p2 = &a;//指针常量,指针的指向不可以修改，但指针指向的值可以修改
    *p2 = 100;
    cout << "a = " << a << endl;

    const int* const p3 = &a;//指针的指向以及指向的值都不可修改
    cout << "*p3 = " << *p3 << endl;

    system("pause");
    return 0;
}